package com.company;

public class Main {
    /*
    Необходимо реализовать приложение, работающее с шарами.
    Первый вспомогательный класс - точка - определяется
    параметрами x, y, z - координатами точки в трёхмерном
    пространстве. Второй вспомогательный класс - шар - определяется
    параметрами p и R - точкой центра и радиусом.
    Помимо этого, у отрезка должен быть метод inside, который
    в качестве аргумента принимает точку. Он должен возвращать
    true, если точка находится внутри шара. Основной класс должен запросить
    у пользователя координаты центра шара и его радиус,
    после чего создать объект шара. После этого он должен
    запросить у пользователя координаты точки и вывести ответ -
    находится ли точка внутри шара.
    * */
    public static void main(String[] args) {
	// write your code here
    }
}
